local time_source  --источник метки времени (ПЛК\Сервер)
local AS=10000  --аварии
local WS=10100 --предупреждения
local TS=101  --телесигнализация
local CO=102 --команды
local NS=30000 --неквитируемые сигналы
local DS=30100 --недостоверность
local RAW=30109 --недостоверность
local OBMEN_NN_OLD=0
local user=Core["USER_NAME_OUT"] -- текущее имя  пользователя

local objects=					--Список объектов для ФЛАГОВ состояния и строки сообщения
{
["RAW_SEPAM_VV1_"]="S_ZRU_P11_VV1_"
}
local EDB = {
["51443"]={["hex"]= "C8F3",["msg"]="Потеря информации во второй зоне событий", ["cat"]=TS},
["51444"]={["hex"]= "C8F4",["msg"]="Есть события во второй зоне событий", ["cat"]=TS},
["51445"]={["hex"]= "C8F5",["msg"]="Задействована группа уставок А", ["cat"]=TS},
["51446"]={["hex"]= "C8F6",["msg"]="Задействована группа уставок В", ["cat"]=TS},
["51447"]={["hex"]= "C8F7",["msg"]="Не установлено время в Sepam-80", ["cat"]=TS},
["51448"]={["hex"]= "C8F8",["msg"]="Частич.поврежд.блока обраб.данных Sepam-80", ["cat"]=TS},
["51449"]={["hex"]= "C8F9",["msg"]="Крупное повреждение Sepam-80", ["cat"]=TS},
["51450"]={["hex"]= "C8FA",["msg"]="Подключились к Sepam с пульта на подстанции", ["cat"]=TS},
["51451"]={["hex"]= "C8FB",["msg"]="Телерегулировки запрещены", ["cat"]=TS},
["51452"]={["hex"]= "C8FC",["msg"]="Тип сети (1-инд 0-емк)", ["cat"]=TS},
["51453"]={["hex"]= "C8FD",["msg"]="Sepam-80 не синхронизирован", ["cat"]=TS},
["51454"]={["hex"]= "C8FE",["msg"]="Потеря информации в первой зоне событий", ["cat"]=TS},
["51455"]={["hex"]= "C8FF",["msg"]="Есть события во первой зоне событий", ["cat"]=TS},
["49408"]={["hex"]= "C100",["msg"]="РПВ", ["cat"]=TS},
["49409"]={["hex"]= "C101",["msg"]="РПО", ["cat"]=TS},

["49412"]={["hex"]= "C104",["msg"]="Клапан ДГЗ", ["cat"]=AS},
--["49421"]={["hex"]= "C10D",["msg"]="Выключатель выкачен", ["cat"]=TS},
--["51453"]={["hex"]= "C8FD",["msg"]="TS69, Выключатель выкачен", ["cat"]=TS},

["49413"]={["hex"]= "C105",["msg"]="РКО", ["cat"]=TS},
["49414"]={["hex"]= "C106",["msg"]="РКВ", ["cat"]=TS},
["49456"]={["hex"]= "C130",["msg"]="Напряжение фазы A", ["cat"]=TS},
["49457"]={["hex"]= "C131",["msg"]="Напряжение фазы B", ["cat"]=TS},
["49458"]={["hex"]= "C132",["msg"]="Напряжение фазы C", ["cat"]=TS},
["49459"]={["hex"]= "C133",["msg"]="V4 (3-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49460"]={["hex"]= "C134",["msg"]="V5 (4-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49461"]={["hex"]= "C135",["msg"]="V6 (5-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49462"]={["hex"]= "C136",["msg"]="V7 (6-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49463"]={["hex"]= "C137",["msg"]="V8 (7-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49464"]={["hex"]= "C138",["msg"]="V9 (8-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49465"]={["hex"]= "C139",["msg"]="V10 ( 9-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49466"]={["hex"]= "C13A",["msg"]="V11 (10-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49467"]={["hex"]= "C13B",["msg"]="V12 (11-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49468"]={["hex"]= "C13C",["msg"]="V13 (12-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49469"]={["hex"]= "C13D",["msg"]="V14 (13-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49470"]={["hex"]= "C13E",["msg"]="V15 (14-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49471"]={["hex"]= "C13F",["msg"]="V16 (15-й бит 1го слова логического уравнения)", ["cat"]=TS},
["49472"]={["hex"]= "C140",["msg"]="V17 (0-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49473"]={["hex"]= "C141",["msg"]="V18 (1-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49474"]={["hex"]= "C142",["msg"]="V19 (2-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49475"]={["hex"]= "C143",["msg"]="V20 (3-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49476"]={["hex"]= "C144",["msg"]="V_DECL", ["cat"]=TS},
["49477"]={["hex"]= "C145",["msg"]="V_CLOSE (5-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49478"]={["hex"]= "C146",["msg"]="V_VER_ENCL (6-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49479"]={["hex"]= "C147",["msg"]="V_OPG (7-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49480"]={["hex"]= "C148",["msg"]="V_RESET (8-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49481"]={["hex"]= "C149",["msg"]="V_CLEAR (9-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49482"]={["hex"]= "C14A",["msg"]="V_INHI_LOCAL_RESET (10-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49483"]={["hex"]= "C14B",["msg"]="V_SHUTDOWN (11-й бит 2го слова логического уравнения)", ["cat"]=TS},
["49484"]={["hex"]= "C14C",["msg"]="V_DESEXCIATION (12-й бит 2го слова логического уравнения)", ["cat"]=TS},
["51328"]={["hex"]= "C880",["msg"]="Отключение выключателя", ["cat"]=TS},
["51329"]={["hex"]= "C881",["msg"]="Включение выключателя", ["cat"]=TS},
["51330"]={["hex"]= "C882",["msg"]="Возврат Sepam-80 в исходное состояние", ["cat"]=TS},
["51331"]={["hex"]= "C883",["msg"]="Обнуление максиметров тока", ["cat"]=TS},
["51332"]={["hex"]= "C884",["msg"]="Обнуление максиметров мощности", ["cat"]=TS},
["51335"]={["hex"]= "C887",["msg"]="Ввод АПВ в работу", ["cat"]=TS},
["51336"]={["hex"]= "C888",["msg"]="Вывод АПВ из работы", ["cat"]=TS},
["51345"]={["hex"]= "C891",["msg"]="Блокировка запуска записи осциллограмм", ["cat"]=TS},
["51346"]={["hex"]= "C892",["msg"]="Подтверждение запуска записи осциллограмм", ["cat"]=TS},
["51347"]={["hex"]= "C893",["msg"]="Ручной пуск записи осциллограммы", ["cat"]=TS},
["51357"]={["hex"]= "C89D",["msg"]="Блокировка тепловой защиты", ["cat"]=TS},
["51358"]={["hex"]= "C89E",["msg"]="Подтверждение тепловой защиты", ["cat"]=TS},
["51359"]={["hex"]= "C89F",["msg"]="Возврат в исходное положение минимальной токовой защиты", ["cat"]=TS},
["51360"]={["hex"]= "C8A0",["msg"]="Переключение на группу уставок А", ["cat"]=TS},
["51361"]={["hex"]= "C8A1",["msg"]="Переключение на группу уставок В", ["cat"]=TS},
["51362"]={["hex"]= "C8A2",["msg"]="Блокировка приоритетной группы", ["cat"]=TS},
["51363"]={["hex"]= "C8A3",["msg"]="Отмена блокировки приоритетной группы", ["cat"]=TS},
["51456"]={["hex"]= "C900",["msg"]="Несогласованность или контроль цепи отключения", ["cat"]=TS},
["51457"]={["hex"]= "C901",["msg"]="Отказ управления", ["cat"]=TS},
["51458"]={["hex"]= "C902",["msg"]="Несогласованность положения и телекоманды", ["cat"]=TS},
["51459"]={["hex"]= "C903",["msg"]="Внешнее отключение 1", ["cat"]=TS},
["51460"]={["hex"]= "C904",["msg"]="Sepam не квитирован", ["cat"]=TS},
["51461"]={["hex"]= "C905",["msg"]="Внешнее отключение 2", ["cat"]=TS},
["51462"]={["hex"]= "C906",["msg"]="Внешнее отключение 3", ["cat"]=TS},
["51463"]={["hex"]= "C907",["msg"]="Индуктивный COS", ["cat"]=TS},
["51464"]={["hex"]= "C908",["msg"]="Емкостной COS", ["cat"]=TS},
["51465"]={["hex"]= "C909",["msg"]="Выключатель включен", ["cat"]=TS},
["51466"]={["hex"]= "C90A",["msg"]="Тележка выключателя выкачена", ["cat"]=TS},
["51467"]={["hex"]= "C90B",["msg"]="Сигнал SF6", ["cat"]=AS},
["51468"]={["hex"]= "C90C",["msg"]="Заземляющий разъединитель включен", ["cat"]=TS},
["51469"]={["hex"]= "C90D",["msg"]="Разрешение телеуправления", ["cat"]=TS},
["51470"]={["hex"]= "C90E",["msg"]="Максимальные токовые защиты (синтез)", ["cat"]=AS},
["51487"]={["hex"]= "C91F",["msg"]="Выдача логического ожидания 1", ["cat"]=TS},
["51504"]={["hex"]= "C930",["msg"]="Записывается осциллограмма аварийного режима", ["cat"]=TS},
["51505"]={["hex"]= "C931",["msg"]="Блокировка записи осциллограмм аварийных режимов", ["cat"]=TS},
["51506"]={["hex"]= "C932",["msg"]="Запрет телерегулировки", ["cat"]=TS},

["51519"]={["hex"]= "C93F",["msg"]="Срабатывание клапанов дуговой защиты", ["cat"]=AS},

["51520"]={["hex"]= "C940",["msg"]="TS65,Защита 50/51 экземпляр 1", ["cat"]=AS},
["51521"]={["hex"]= "C941",["msg"]="TS66,Защита 50/51 экземпляр 2", ["cat"]=AS},
["51522"]={["hex"]= "C942",["msg"]="TS67,Защита 50/51 экземпляр 3", ["cat"]=AS},
["51523"]={["hex"]= "C943",["msg"]="TS68,Защита 50/51 экземпляр 4", ["cat"]=AS},
["51524"]={["hex"]= "C944",["msg"]="TS69,Защита 50/51 экземпляр 5", ["cat"]=AS},
["51525"]={["hex"]= "C945",["msg"]="TS70,Защита 50/51 экземпляр 6", ["cat"]=AS},
["51526"]={["hex"]= "C946",["msg"]="TS71,Защита 50/51 экземпляр 7", ["cat"]=AS},
["51527"]={["hex"]= "C947",["msg"]="TS72,Защита 50/51 экземпляр 8", ["cat"]=AS},
["51528"]={["hex"]= "C948",["msg"]="TS73,Защита 50N/51N экземпляр 1", ["cat"]=AS},
["51529"]={["hex"]= "C949",["msg"]="TS74,Защита 50N/51N экземпляр 2", ["cat"]=AS},
["51530"]={["hex"]= "C94A",["msg"]="TS75,Защита 50N/51N экземпляр 3", ["cat"]=AS},
["51531"]={["hex"]= "C94B",["msg"]="TS76,Защита 50N/51N экземпляр 4", ["cat"]=AS},
["51532"]={["hex"]= "C94C",["msg"]="TS77,Защита 50N/51N экземпляр 5", ["cat"]=AS},
["51533"]={["hex"]= "C94D",["msg"]="TS78,Защита 50N/51N экземпляр 6", ["cat"]=AS},
["51534"]={["hex"]= "C94E",["msg"]="TS79,Защита 50N/51N экземпляр 7", ["cat"]=AS},
["51535"]={["hex"]= "C94F",["msg"]="TS80,Защита 50N/51N экземпляр 8", ["cat"]=AS},
["51536"]={["hex"]= "C950",["msg"]="TS81,Защита 27/27S экземпляр 1", ["cat"]=AS},
["51537"]={["hex"]= "C951",["msg"]="TS82,Защита 27/27S экземпляр 2", ["cat"]=AS},
["51538"]={["hex"]= "C952",["msg"]="TS83,Защита 27/27S экземпляр 3", ["cat"]=AS},
["51539"]={["hex"]= "C953",["msg"]="TS84,Защита 27/27S экземпляр 4", ["cat"]=AS},
["51540"]={["hex"]= "C954",["msg"]="TS85,Защита 27D экземпляр 1", ["cat"]=AS},
["51541"]={["hex"]= "C955",["msg"]="TS86,Защита 27D экземпляр 2", ["cat"]=AS},
["51542"]={["hex"]= "C956",["msg"]="TS87,Защита 27R экземпляр 1", ["cat"]=AS},
["51543"]={["hex"]= "C957",["msg"]="TS88,Защита 27R экземпляр 2", ["cat"]=AS},
["51544"]={["hex"]= "C958",["msg"]="TS89,Защита 59 экземпляр 1", ["cat"]=AS},
["51545"]={["hex"]= "C959",["msg"]="TS90,Защита 59 экземпляр 2", ["cat"]=AS},
["51546"]={["hex"]= "C95A",["msg"]="TS91,Защита 59 экземпляр 3", ["cat"]=AS},
["51547"]={["hex"]= "C95B",["msg"]="TS92,Защита 59 экземпляр 4", ["cat"]=AS},
["51548"]={["hex"]= "C95C",["msg"]="TS93,Защита 59N экземпляр 1", ["cat"]=AS},
["51549"]={["hex"]= "C95D",["msg"]="TS94,Защита 59N экземпляр 2", ["cat"]=AS},
["51550"]={["hex"]= "C95E",["msg"]="TS95,Защита 51V экземпляр 1", ["cat"]=AS},
["51551"]={["hex"]= "C95F",["msg"]="TS96,Защита 51V экземпляр 2", ["cat"]=AS},
["51552"]={["hex"]= "C960",["msg"]="TS97,Защита 67 экземпляр 1", ["cat"]=AS},
["51553"]={["hex"]= "C961",["msg"]="TS98,Защита 67 экземпляр 2", ["cat"]=AS},
["51554"]={["hex"]= "C962",["msg"]="TS99,Защита 67N экземпляр 1", ["cat"]=AS},
["51555"]={["hex"]= "C963",["msg"]="TS100,Защита 67N экземпляр 2", ["cat"]=AS},
["51556"]={["hex"]= "C964",["msg"]="TS101,Защита 46 экземпляр 1", ["cat"]=AS},
["51557"]={["hex"]= "C965",["msg"]="TS102,Защита 46 экземпляр 2", ["cat"]=AS},
["51558"]={["hex"]= "C966",["msg"]="TS103,Защита 47 экземпляр 1", ["cat"]=AS},
["51559"]={["hex"]= "C967",["msg"]="TS104,Защита 47 экземпляр 2", ["cat"]=AS},
["51560"]={["hex"]= "C968",["msg"]="TS105,Защита 32P экземпляр 1", ["cat"]=AS},
["51561"]={["hex"]= "C969",["msg"]="TS106,Защита 32P экземпляр 2", ["cat"]=AS},
["51562"]={["hex"]= "C96A",["msg"]="Пуск защиты от асинхронного хода (Защита 32Q)", ["cat"]=AS},
["51563"]={["hex"]= "C96B",["msg"]="TS108,Защита 37", ["cat"]=AS},
["51564"]={["hex"]= "C96C",["msg"]="TS109,Защита 37P экземпляр 1", ["cat"]=AS},
["51565"]={["hex"]= "C96D",["msg"]="TS110,Защита 37P экземпляр 2", ["cat"]=AS},
["51566"]={["hex"]= "C96E",["msg"]="TS111,Защита 40", ["cat"]=AS},
["51567"]={["hex"]= "C96F",["msg"]="Пуск УРОВ (Защита 50BF)", ["cat"]=AS},
["51568"]={["hex"]= "C970",["msg"]="TS113,Защита 49RMS сооб. о превыш. уставки", ["cat"]=AS},
["51569"]={["hex"]= "C971",["msg"]="TS114,Защита 49RMS сраб. при превыш. уставки", ["cat"]=AS},
["51570"]={["hex"]= "C972",["msg"]="TS115,Защита 48/51LR (блокировка ротора)", ["cat"]=AS},
["51571"]={["hex"]= "C973",["msg"]="TS116,Защита 48/51LR (блокировка ротора)", ["cat"]=AS},
["51572"]={["hex"]= "C974",["msg"]="TS117,Защита 48/51LR (блокировка ротора при запуске)", ["cat"]=AS},
["51573"]={["hex"]= "C975",["msg"]="TS118,Защита 66", ["cat"]=AS},
["51574"]={["hex"]= "C976",["msg"]="TS119,Защита 21B", ["cat"]=AS},
["51575"]={["hex"]= "C977",["msg"]="TS120,Защита 50/27", ["cat"]=AS},
["51576"]={["hex"]= "C978",["msg"]="TS121,Защита 62G2/27TN экземпляр 1", ["cat"]=AS},
["51577"]={["hex"]= "C979",["msg"]="TS122,Защита 62G2/27TN экземпляр 2", ["cat"]=AS},
["51578"]={["hex"]= "C97A",["msg"]="TS123,Защита 78PS", ["cat"]=AS},
["51579"]={["hex"]= "C97B",["msg"]="TS124,Защита 67REF экземпляр 1", ["cat"]=AS},
["51580"]={["hex"]= "C97C",["msg"]="TS125,Защита 67REF экземпляр 2", ["cat"]=AS},
["51581"]={["hex"]= "C97D",["msg"]="TS126,Защита 87T2", ["cat"]=AS},
["51582"]={["hex"]= "C97E",["msg"]="TS127,Защита 87M/87G", ["cat"]=AS},
["51584"]={["hex"]= "C980",["msg"]="TS129,Защита 81H экземпляр 1", ["cat"]=AS},
["51585"]={["hex"]= "C981",["msg"]="TS130,Защита 81H экземпляр 2", ["cat"]=AS},
["51586"]={["hex"]= "C982",["msg"]="TS131,Защита 81L экземпляр 1", ["cat"]=AS},
["51587"]={["hex"]= "C983",["msg"]="TS132,Защита 81L экземпляр 2", ["cat"]=AS},
["51588"]={["hex"]= "C984",["msg"]="TS133,Защита 81L экземпляр 3", ["cat"]=AS},
["51589"]={["hex"]= "C985",["msg"]="TS134,Защита 81L экземпляр 4", ["cat"]=AS},
["51592"]={["hex"]= "C988",["msg"]="TS137,Защита 12 экземпляр 1", ["cat"]=AS},
["51593"]={["hex"]= "C989",["msg"]="TS138,Защита 12 экземпляр 2", ["cat"]=AS},
["51594"]={["hex"]= "C98A",["msg"]="TS139,Защита 14 экземпляр 1", ["cat"]=AS},
["51595"]={["hex"]= "C98B",["msg"]="TS140,Защита 14 экземпляр 2", ["cat"]=AS},
["51596"]={["hex"]= "C98C",["msg"]="TS141,Защита 24 экземпляр 1", ["cat"]=AS},
["51597"]={["hex"]= "C98D",["msg"]="TS142,Защита 24 экземпляр 2", ["cat"]=AS},
["51600"]={["hex"]= "C990",["msg"]="TS145,Защита 38/49T модуль MET 148 №1 уставка сигн.датчика 1", ["cat"]=AS},
["51601"]={["hex"]= "C991",["msg"]="TS146,Защита 38/49T модуль MET 148 №1 уставка откл.датчика 1", ["cat"]=AS},
["51602"]={["hex"]= "C992",["msg"]="TS147,Защита 38/49T модуль MET 148 №1 уставка сигн.датчика 2", ["cat"]=AS},
["51603"]={["hex"]= "C993",["msg"]="TS148,Защита 38/49T модуль MET 148 №1 уставка откл.датчика 2", ["cat"]=AS},
["51604"]={["hex"]= "C994",["msg"]="TS149,Защита 38/49T модуль MET 148 №1 уставка сигн.датчика 3", ["cat"]=AS},
["51605"]={["hex"]= "C995",["msg"]="TS150,Защита 38/49T модуль MET 148 №1 уставка откл.датчика 3", ["cat"]=AS},
["51606"]={["hex"]= "C996",["msg"]="TS151,Защита 38/49T модуль MET 148 №1 уставка сигн.датчика 4", ["cat"]=AS},
["51607"]={["hex"]= "C997",["msg"]="TS152,Защита 38/49T модуль MET 148 №1 уставка откл.датчика 4", ["cat"]=AS},
["51608"]={["hex"]= "C998",["msg"]="TS153,Защита 38/49T модуль MET 148 №1 уставка сигн.датчика 5", ["cat"]=AS},
["51609"]={["hex"]= "C999",["msg"]="TS154,Защита 38/49T модуль MET 148 №1 уставка откл.датчика 5", ["cat"]=AS},
["51610"]={["hex"]= "C99A",["msg"]="TS155,Защита 38/49T модуль MET 148 №1 уставка сигн.датчика 6", ["cat"]=AS},
["51611"]={["hex"]= "C99B",["msg"]="TS156,Защита 38/49T модуль MET 148 №1 уставка откл.датчика 6", ["cat"]=AS},
["51612"]={["hex"]= "C99C",["msg"]="TS157,Защита 38/49T модуль MET 148 №1 уставка сигн.датчика 7", ["cat"]=AS},
["51613"]={["hex"]= "C99D",["msg"]="TS158,Защита 38/49T модуль MET 148 №1 уставка откл.датчика 7", ["cat"]=AS},
["51614"]={["hex"]= "C99E",["msg"]="TS159,Защита 38/49T модуль MET 148 №1 уставка сигн.датчика 8", ["cat"]=AS},
["51615"]={["hex"]= "C99F",["msg"]="TS160,Защита 38/49T модуль MET 148 №1 уставка откл.датчика 8", ["cat"]=AS},
["51616"]={["hex"]= "C9A0",["msg"]="TS161,Защита 38/49T модуль MET 148 №2 уставка сигн.датчика 1", ["cat"]=AS},
["51617"]={["hex"]= "C9A1",["msg"]="TS162,Защита 38/49T модуль MET 148 №2 уставка откл.датчика 1", ["cat"]=AS},
["51618"]={["hex"]= "C9A2",["msg"]="TS163,Защита 38/49T модуль MET 148 №2 уставка сигн.датчика 2", ["cat"]=AS},
["51619"]={["hex"]= "C9A3",["msg"]="TS164,Защита 38/49T модуль MET 148 №2 уставка откл.датчика 2", ["cat"]=AS},
["51620"]={["hex"]= "C9A4",["msg"]="TS165,Защита 38/49T модуль MET 148 №2 уставка сигн.датчика 3", ["cat"]=AS},
["51621"]={["hex"]= "C9A5",["msg"]="TS166,Защита 38/49T модуль MET 148 №2 уставка откл.датчика 3", ["cat"]=AS},
["51622"]={["hex"]= "C9A6",["msg"]="TS167,Защита 38/49T модуль MET 148 №2 уставка сигн.датчика 4", ["cat"]=AS},
["51623"]={["hex"]= "C9A7",["msg"]="TS168,Защита 38/49T модуль MET 148 №2 уставка откл.датчика 4", ["cat"]=AS},
["51624"]={["hex"]= "C9A8",["msg"]="TS169,Защита 38/49T модуль MET 148 №2 уставка сигн.датчика 5", ["cat"]=AS},
["51625"]={["hex"]= "C9A9",["msg"]="TS170,Защита 38/49T модуль MET 148 №2 уставка откл.датчика 5", ["cat"]=AS},
["51626"]={["hex"]= "C9AA",["msg"]="TS171,Защита 38/49T модуль MET 148 №2 уставка сигн.датчика 6", ["cat"]=AS},
["51627"]={["hex"]= "C9AB",["msg"]="TS172,Защита 38/49T модуль MET 148 №2 уставка откл.датчика 6", ["cat"]=AS},
["51628"]={["hex"]= "C9AC",["msg"]="TS173,Защита 38/49T модуль MET 148 №2 уставка сигн.датчика 7", ["cat"]=AS},
["51629"]={["hex"]= "C9AD",["msg"]="TS174,Защита 38/49T модуль MET 148 №2 уставка откл.датчика 7", ["cat"]=AS},
["51630"]={["hex"]= "C9AE",["msg"]="TS175,Защита 38/49T модуль MET 148 №2 уставка сигн.датчика 8", ["cat"]=AS},
["51631"]={["hex"]= "C9AF",["msg"]="TS176,Защита 38/49T модуль MET 148 №2 уставка откл.датчика 8", ["cat"]=AS},

["51632"]={["hex"]= "C9B0",["msg"]="TS177,Отключение от ДГЗ, УРОВ", ["cat"]=AS},
["51640"]={["hex"]= "C9B8",["msg"]="TS185,Сигнал от термистора", ["cat"]=AS},
["51641"]={["hex"]= "C9B9",["msg"]="TS186,Отключение термистора", ["cat"]=AS},
["51642"]={["hex"]= "C9BA",["msg"]="TS187,Сигнал от газового реле", ["cat"]=AS},
["51643"]={["hex"]= "C9BB",["msg"]="TS188,Отключение газового реле", ["cat"]=AS},
["51644"]={["hex"]= "C9BC",["msg"]="TS189,Сигнал от термостата", ["cat"]=AS},
["51645"]={["hex"]= "C9BD",["msg"]="TS190,Отключение термостата", ["cat"]=AS},
["51646"]={["hex"]= "C9BE",["msg"]="TS191,Сигнал по давлению", ["cat"]=AS},
["51647"]={["hex"]= "C9BF",["msg"]="TS192,Отключение по давлению", ["cat"]=AS},
["51648"]={["hex"]= "C9C0",["msg"]="TS193,Повреждение датчиков модуля MET 148-1", ["cat"]=AS},
["51649"]={["hex"]= "C9C1",["msg"]="TS194,Повреждение датчиков модуля MET 148-2", ["cat"]=AS},
["51650"]={["hex"]= "C9C2",["msg"]="TS195,Отмена отключения тепловой защитой", ["cat"]=AS},
["51651"]={["hex"]= "C9C3",["msg"]="TS196,Обратное направление вращения основных фаз", ["cat"]=AS},
["51652"]={["hex"]= "C9C4",["msg"]="TS197,Обратное направление вращения дополнительных фаз", ["cat"]=AS},
["51653"]={["hex"]= "C9C5",["msg"]="TS198,Выдача логического ожидания 2", ["cat"]=AS},
["51654"]={["hex"]= "C9C6",["msg"]="TS199,АПВ в действии", ["cat"]=AS},
["51655"]={["hex"]= "C9C7",["msg"]="TS200,Готовность АПВ", ["cat"]=AS},
["51656"]={["hex"]= "C9C8",["msg"]="TS201,Окончательное отключение АПВ", ["cat"]=AS},
["51657"]={["hex"]= "C9C9",["msg"]="TS202,Успешное АПВ", ["cat"]=AS},
["51658"]={["hex"]= "C9CA",["msg"]="TS203,Цикл 1 АПВ в действии", ["cat"]=AS},
["51659"]={["hex"]= "C9CB",["msg"]="TS204,Цикл 2 АПВ в действии", ["cat"]=AS},
["51660"]={["hex"]= "C9CC",["msg"]="TS205,Цикл 3 АПВ в действии", ["cat"]=AS},
["51661"]={["hex"]= "C9CD",["msg"]="TS206,Цикл 4 АПВ в действии", ["cat"]=AS},
["51662"]={["hex"]= "C9CE",["msg"]="TS207,АПВ введено", ["cat"]=AS},
["51664"]={["hex"]= "C9D0",["msg"]="TS209,Повреждение фаз ТТ", ["cat"]=AS},
["51665"]={["hex"]= "C9D1",["msg"]="TS210,Повреждение фаз ТН", ["cat"]=AS},
["51666"]={["hex"]= "C9D2",["msg"]="TS211,Повреждение ТН нулевой последовательности", ["cat"]=AS},
["51667"]={["hex"]= "C9D3",["msg"]="TS212,Повреждение дополнительных фаз ТТ", ["cat"]=AS},
["51668"]={["hex"]= "C9D4",["msg"]="TS213,Повреждение дополнительных фаз ТН", ["cat"]=AS},
["51670"]={["hex"]= "C9D6",["msg"]="TS215,Разгрузка", ["cat"]=AS},
["51671"]={["hex"]= "C9D7",["msg"]="TS216,Повторный пуск", ["cat"]=AS},
["51672"]={["hex"]= "C9D8",["msg"]="TS217,Мин. V_aux (оперативное питание)", ["cat"]=AS},
["51673"]={["hex"]= "C9D9",["msg"]="TS218,Макс. V_aux (оперативное питание)", ["cat"]=AS},
["51674"]={["hex"]= "C9DA",["msg"]="TS219,Разряжена или отсутствует батарея питания", ["cat"]=AS},
["51675"]={["hex"]= "C9DB",["msg"]="TS220,Запрос для закрытия проверки синхронизации", ["cat"]=AS},
["51676"]={["hex"]= "C9DC",["msg"]="TS221,dU сбой синхронизации", ["cat"]=AS},
["51677"]={["hex"]= "C9DD",["msg"]="TS222,dPhi сбой синхронизации", ["cat"]=AS},
["51678"]={["hex"]= "C9DE",["msg"]="TS223,dF сбой синхронизации", ["cat"]=AS},
["51679"]={["hex"]= "C9DF",["msg"]="TS224,Остановка синхронизации", ["cat"]=AS},
["51680"]={["hex"]= "C9E0",["msg"]="TS225,Синхронизация не удалась", ["cat"]=AS},
["51681"]={["hex"]= "C9E1",["msg"]="TS226,Успешная синхронизация", ["cat"]=AS},
["51682"]={["hex"]= "C9E2",["msg"]="TS227,Ручное управление шагом конденсатора", ["cat"]=AS},
["51683"]={["hex"]= "C9E3",["msg"]="TS228,Автоматическое управление шагом конденсатора", ["cat"]=AS},
["51684"]={["hex"]= "C9E4",["msg"]="TS229,Шаг 1 проверки разряда конденсатора", ["cat"]=AS},
["51685"]={["hex"]= "C9E5",["msg"]="TS230,Шаг 2 проверки разряда конденсатора", ["cat"]=AS},
["51686"]={["hex"]= "C9E6",["msg"]="TS231,Шаг 3 проверки разряда конденсатора", ["cat"]=AS},
["51687"]={["hex"]= "C9E7",["msg"]="TS232,Шаг 4 проверки разряда конденсатора", ["cat"]=AS},
["51688"]={["hex"]= "C9E8",["msg"]="TS233", ["cat"]=AS},
["51689"]={["hex"]= "C9E9",["msg"]="TS234,Закрытие мониторинга катушки", ["cat"]=AS},
["51690"]={["hex"]= "C9EA",["msg"]="TS235,Мониторинг совокупных токов срабатывания", ["cat"]=AS},
["51691"]={["hex"]= "C9EB",["msg"]="TS236,Связанный порядок закрытия", ["cat"]=AS},
["51692"]={["hex"]= "C9EC",["msg"]="TS237,Связанный сбой синхронизации", ["cat"]=AS},
["51693"]={["hex"]= "C9ED",["msg"]="TS238,Отключение по автоматической передаче", ["cat"]=AS},


}
local function Event_update(Name)	
Core[Name[1].."EVENT_NN_UP"]=1
	  end
--[[	  local RAW_Base =--Список суффиксов флагов состояний, коментариев и строк сообщений 
{
     ["EVENT_WORD_NUMB_CP"]= {["Comment"]="Событие_слово обмена_Номер обмена_", ["eval"]= function(Name) end},
     ["EVENT_WORD_QUANT_CP"]={["Comment"]="Событие_слово обмена_Количество событий_", ["eval"]= function(Name) end},
}]]--
local function add_Event(signal,time_source) --функция генерирования сообщения в журнал.
local timestamp = { year, mouth, day, hour, min, sec, usec } --структура метки времени события
local DT --метка времени
local user --имя текущего пользователя

			 DT = os.time(timestamp)  --метка времени сигнала (PLC)
	 		
		if Core[signal]==true then
				Core.addEvent(msg , catergory , 1, sign_source..time_source, user, signal.."_1", DT) --появление события
		else 	Core.addEvent(msg, catergory, 0, sign_source..time_source, user, signal.."_0", DT) --появление события
		 
			
		 end	
end

local function CheckStack()--функция проверки стека на переполнение

	  end -- of CheckStack


local function ReadStack () --функция считывания стека событий
local timestamp={} -- метка времени
local SignalName=""
local Signal=""
local sig_source=""
local msg
local EVENT_NN=0
local OBMEN_NN=0
local NN=0
local adr=0
local data
local msg=""
	Core["RAW_SEPAM_VV1_".."EVENT_NN_UP"]=1
	os.sleep(1)
	OBMEN_NN=Core.RAW_SEPAM_VV1_EVENT_WORD_NUMB_CP
	if OBMEN_NN~=0  then
	for EVENT_NN=1,Core.RAW_SEPAM_VV1_EVENT_WORD_QUANT_CP do
		if Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_TYPE_CP"]==2048 then
		signal=Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_ADRESS_CP"]
		SignalName="S_ZRU_P11_VV1_"..string.sub (signal,1,4).."_"..string.sub (signal,-1).."_DP"
			if EDB[tostring(Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_ADRESS_CP"])]~=nil then
			-- получаем метку времени события
			timestamp.day=Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_TIME_DAY_CP"] --вычисляем день события
			timestamp.month=Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_TIME_MONTH_CP"]--вычисляем месяц
			timestamp.year=Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_TIME_YEAR_CP"]+2000 --вычисляем год
			timestamp.hour=Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_TIME_HOUR_CP"] --вычисляем час
			timestamp.min=Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_TIME_MIN_CP"]--вычисляем минуты
			timestamp.sec=math.floor(Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_TIME_MS_CP"]/1000)--вычисляем секунды
			timestamp.usec=(Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_TIME_MS_CP"]-timestamp.sec*1000)*1000--вычисляем микросекунды
			local timestamp_str = timestamp.day .. " " .. timestamp.month .. " " .. timestamp.year .. " " .. timestamp.hour .. ":" .. timestamp.min .. ":" ..  timestamp.sec .. "." .. timestamp.usec -- формируем строку времени
			DT=os.time(timestamp)  + os.tz() -- преобразуем метку в формат POSIX c учетом временной зоны
			msg=EDB[tostring(Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_ADRESS_CP"])].msg							
			--Core.addLogMsg(msg)	
			Core.addEvent(msg, EDB[tostring(Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_ADRESS_CP"])].cat , Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_DIR_CP"], "АСУ ЭС_ЗРУ 10 кВ_Панель №11_Ввод 1_".."(Sepam)", user, SignalName..Core["RAW_SEPAM_VV1_EVENT_N"..tostring(EVENT_NN).."_DIR_CP"], DT, "S_ZRU_P11")		
				end			
		end	
	end
	Core.RAW_SEPAM_VV1_EVENT_WORD_QUANT_CP=0
	Core.RAW_SEPAM_VV1_EVENT_WORD_WR_UP=1
	os.sleep(1)
	Core["RAW_SEPAM_VV1_".."EVENT_NN_UP"]=1
	os.sleep(1)
	OBMEN_NN=Core.RAW_SEPAM_VV1_EVENT_WORD_NUMB_CP
	end
	
end --of ReadStack 

local signals = {
	-- Объявление переменных в виде структуры где левая часть до знака = это Suffix, правая часть это Descriptor. Descriptor в свою очередь представляет собой структуру
	-- в которой первый элемент это комментарий Comment, второй элемент это функция eval. В функциях происходит преобразование значений сигналов из регистров, и присваивание этих
	-- преобразованных значений переменным, передаваемым в SCADA систему
	


 }		





	while true do
os.sleep(1)


ReadStack ()
	
	end	









